name: "tensorrt_llm"
backend: "tensorrtllm"
max_batch_size: 16

model_transaction_policy {
  decoupled: true
}

input [
  { name: "input_ids", data_type: TYPE_INT32, dims: [-1] },
  { name: "input_lengths", data_type: TYPE_INT32, dims: [1] },
  { name: "request_output_len", data_type: TYPE_INT32, dims: [1] },
  { name: "streaming", data_type: TYPE_BOOL, dims: [1] },
  { name: "end_id", data_type: TYPE_INT32, dims: [1], optional: true },
  { name: "pad_id", data_type: TYPE_INT32, dims: [1], optional: true }
]

output [
  { name: "output_ids", data_type: TYPE_INT32, dims: [-1, -1] },
  { name: "sequence_length", data_type: TYPE_INT32, dims: [-1] }
]

instance_group [{ count: 1, kind: KIND_GPU }]

parameters {
  key: "gpt_model_type"
  value: { string_value: "inflight_fused_batching" }
}
parameters {
  key: "gpt_model_path"
  value: { string_value: "/workspace/triton_model_repo/tensorrt_llm/1" }
}
parameters {
  key: "max_beam_width"
  value: { string_value: "1" }
}
parameters {
  key: "batching_type"
  value: { string_value: "inflight_fused_batching" }
}
parameters {
  key: "kv_cache_free_gpu_mem_fraction"
  value: { string_value: "0.85" }
}
parameters {
  key: "enable_chunked_context"
  value: { string_value: "true" }
}
